HirokiIshiguro/iot-reference-rx/Projects/aws_wifi_rx671_ek/e2studio_ccrx/src/sdio_host.c
    /* CMD3 SEND_RELATIVE_ADDR: the card publishes its RCA in R6[31:16].
     * Response type 0 lets the SDHI controller auto-select the R6 response. */
    if (!sdhi_issue_command(3U, 0U, 0U, true, &sdsts1, &sdsts2))
    {
        return false;
    }
    (void)R_SDHI_GetResp(SDHI_CH0, &resp);
    rca = (uint16_t)(resp.sdrsp10 >> 16);

    /* CMD7 SELECT_CARD with the RCA: move the addressed card to the transfer
     * state (R1b). */
    if (!sdhi_issue_command(7U, ((uint32_t)rca << 16), 0U, true, &sdsts1, &sdsts2))
    {
        return false;
    }

    *p_rca = rca;
    return true;
}

/* ---- r_sdio_rx protocol layer wiring (increment 3 + 4a + 4b) ---------------
 *
 * r_sdio_rx is a pure protocol layer: it issues CMD52/CMD53 through host
 * callbacks. The CMD52 callback bridges to the polled SDHI command path above;
 * the CMD53 callback drives the data phase (SDSIZE / SDARG / CMD53 -> poll
 * BRE/BWE -> SDBUFR -> ACEND) in both byte mode (increment 4a) and block mode
 * (increment 4b, the firmware-download de-risk gate's transfer primitive). This
 * is the same host the WHD bus backend will sit on. */
static sdio_ctrl_t g_sdio_ctrl;
static sdio_cfg_t  g_sdio_cfg;

/* Host-side CMD52: build the argument, issue it, and return the R5 data byte. */
static bool sdio_cmd52_read(uint8_t function, uint32_t address, uint8_t * p_data, uint32_t * p_r5)
{
    uint32_t sdsts1 = 0U;
    uint32_t sdsts2 = 0U;
    uint32_t arg = R_SDIO_MakeCmd52Arg(false, function, address, false, 0U);
    sdhi_get_resp_t resp = {0};
    bool ok;

    ok = sdhi_issue_command(52U, arg, SDHI_SDCMD_RSP_R1_R5_R6_R7, true, &sdsts1, &sdsts2);
    (void)R_SDHI_GetResp(SDHI_CH0, &resp);
    *p_r5 = resp.sdrsp10;
    *p_data = (uint8_t)resp.sdrsp10;
    return ok;
}

static bool sdio_cmd52_write_raw(uint8_t function, uint32_t address, uint8_t data, bool raw,
                                 uint8_t * p_readback, uint32_t * p_r5)
{
    uint32_t sdsts1 = 0U;
    uint32_t sdsts2 = 0U;
    uint32_t arg = R_SDIO_MakeCmd52Arg(true, function, address, raw, data);
    sdhi_get_resp_t resp = {0};
    bool ok;

    ok = sdhi_issue_command(52U, arg, SDHI_SDCMD_RSP_R1_R5_R6_R7, true, &sdsts1, &sdsts2);
    (void)R_SDHI_GetResp(SDHI_CH0, &resp);
    *p_r5 = resp.sdrsp10;
    *p_readback = (uint8_t)resp.sdrsp10;
    return ok;
}

static sdio_err_t sdio_rx_cmd52_callback(void * p_context, sdio_cmd52_t * p_args)
{
    bool ok;
    uint32_t r5 = 0U;
    uint8_t data = 0U;

    (void)p_context;
    if (NULL == p_args)
    {
        return SDIO_ERR_NULL_PTR;
    }

    if (p_args->write)
    {
        ok = sdio_cmd52_write_raw(p_args->function, p_args->address, p_args->write_data, p_args->raw, &data, &r5);
    }
    else
    {
        ok = sdio_cmd52_read(p_args->function, p_args->address, &data, &r5);
    }

    p_args->read_data = data;
    p_args->r5 = r5;
    return ok ? SDIO_SUCCESS : SDIO_ERR_HOST;
}

/* CMD53 byte-path diagnostics (bring-up). g_cmd53_diag_stage marks how far the
 * last read got: 1 = command/R5, 2 = BRE (RE) wait, 3 = ACEND wait, 0xFF =
 * success; stage 0 means CMD53 was never entered. The SDSTS1/SDSTS2/R5 snapshot
 * is captured at the failure point so the UART log can pinpoint a stall. */
static uint8_t  g_cmd53_diag_stage = 0U;
static uint32_t g_cmd53_diag_s1 = 0U;
static uint32_t g_cmd53_diag_s2 = 0U;
static uint32_t g_cmd53_diag_er1 = 0U;
static uint32_t g_cmd53_diag_er2 = 0U;
static uint32_t g_cmd53_diag_r5 = 0U;
static uint32_t g_cmd53_diag_data0 = 0U;

/* Per-function SDIO block size (bytes), set by sdio_host_set_block_size and used
 * by the CMD53 block-mode transfer. */
static uint16_t g_sdio_block_size[SDIO_MAX_FUNCTION + 1U];
static bool g_sdio_high_speed_enabled = false;

#if (SDIO_HOST_CMD53_XFER_ENGINE == SDIO_HOST_CMD53_XFER_DTC)
static bool g_cmd53_dtc_opened = false;
static volatile bool g_cmd53_dtc_active = false;
static volatile uint32_t g_cmd53_dtc_count = 0U;
static volatile uint32_t g_cmd53_dtc_fallback_count = 0U;
static volatile uint32_t g_cmd53_dtc_fb_function_count = 0U;
static volatile uint32_t g_cmd53_dtc_fb_disabled_count = 0U;
static volatile uint32_t g_cmd53_dtc_fb_small_count = 0U;
static volatile uint32_t g_cmd53_dtc_fb_ineligible_count = 0U;
static volatile uint32_t g_cmd53_dtc_fb_prepare_count = 0U;
static volatile uint32_t g_cmd53_dtc_error = 0U;
static volatile uint32_t g_cmd53_dtc_ok_count = 0U;
static volatile uint32_t g_cmd53_dtc_fail_count = 0U;
static volatile uint32_t g_cmd53_dtc_last_seq = 0U;
static volatile uint32_t g_cmd53_dtc_last_ctrl = 0U;
static volatile uint32_t g_cmd53_dtc_last_addr = 0U;
static volatile uint32_t g_cmd53_dtc_last_len = 0U;
static volatile uint32_t g_cmd53_dtc_last_blocks = 0U;
static volatile uint32_t g_cmd53_dtc_last_data = 0U;
static volatile uint32_t g_cmd53_dtc_last_r5 = 0U;
static volatile uint32_t g_cmd53_dtc_last_s1 = 0U;
static volatile uint32_t g_cmd53_dtc_last_s2 = 0U;
static dtc_transfer_data_t g_cmd53_dtc_data;
static dtc_transfer_data_cfg_t g_cmd53_dtc_cfg;
static dtc_cmd_arg_t g_cmd53_dtc_args;
#endif

#if (SDIO_HOST_CMD53_XFER_ENGINE == SDIO_HOST_CMD53_XFER_DMACA)
static bool g_cmd53_dmaca_opened = false;
static volatile bool g_cmd53_dmaca_active = false;
static volatile uint32_t g_cmd53_dmaca_count = 0U;
static volatile uint32_t g_cmd53_dmaca_fallback_count = 0U;
static volatile uint32_t g_cmd53_dmaca_fb_function_count = 0U;
static volatile uint32_t g_cmd53_dmaca_fb_disabled_count = 0U;
static volatile uint32_t g_cmd53_dmaca_fb_small_count = 0U;
static volatile uint32_t g_cmd53_dmaca_fb_ineligible_count = 0U;
static volatile uint32_t g_cmd53_dmaca_fb_prepare_count = 0U;
static volatile uint32_t g_cmd53_dmaca_error = 0U;
static volatile uint32_t g_cmd53_dmaca_ok_count = 0U;
static volatile uint32_t g_cmd53_dmaca_fail_count = 0U;
static volatile uint32_t g_cmd53_dmaca_last_seq = 0U;
static volatile uint32_t g_cmd53_dmaca_last_ctrl = 0U;
static volatile uint32_t g_cmd53_dmaca_last_addr = 0U;
static volatile uint32_t g_cmd53_dmaca_last_len = 0U;
static volatile uint32_t g_cmd53_dmaca_last_blocks = 0U;
static volatile uint32_t g_cmd53_dmaca_last_data = 0U;
static volatile uint32_t g_cmd53_dmaca_last_r5 = 0U;
static volatile uint32_t g_cmd53_dmaca_last_s1 = 0U;
static volatile uint32_t g_cmd53_dmaca_last_s2 = 0U;
static dmaca_transfer_data_cfg_t g_cmd53_dmaca_cfg;
#endif

