HirokiIshiguro/iot-reference-rx/Projects/aws_wifi_rx671_ek/e2studio_ccrx/src/sdio_host.c
/*
 * Issue #28 force-stop: a CMD53 whose data phase never starts leaves the
 * command engine CBSY, and a busy host then silently swallows every later
 * CMD52 - including the abort the SDPCM layer would send next. Pulse SDSTOP
 * (STP) to free the controller before returning the failure.
 */
static void sdhi_cmd53_force_stop(uint32_t * p_sdsts2)
{
    uint32_t timeout = SDHI_CMD_TIMEOUT;
    uint32_t sdsts2 = 0U;

    (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDSTOP, SDHI_SDSTOP_SEC_ENABLE | SDHI_SDSTOP_STP_STOP);
    while (0UL != timeout)
    {
        (void)R_SDHI_InReg(SDHI_CH0, SDHI_SDSTS2, &sdsts2);
        if (0U == (sdsts2 & SDHI_SDIMSK2_CBSY))
        {
            break;
        }
        timeout--;
    }
    (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDSTOP, SDHI_SDSTOP_INIT);
    if (NULL != p_sdsts2)
    {
        *p_sdsts2 = sdsts2;
    }
}

static void sdhi_cmd53_capture_diag(uint32_t sdsts1, uint32_t sdsts2, uint32_t r5)
{
    g_cmd53_diag_s1 = sdsts1;
    g_cmd53_diag_s2 = sdsts2;
    g_cmd53_diag_r5 = r5;
    (void)R_SDHI_InReg(SDHI_CH0, SDHI_SDERSTS1, &g_cmd53_diag_er1);
    (void)R_SDHI_InReg(SDHI_CH0, SDHI_SDERSTS2, &g_cmd53_diag_er2);
}

/* Launch a CMD53 and poll for the R5 response. The command word already carries
 * the index, response type, and data-direction bits, so it is written raw (not
 * built through sdhi_make_cmd). */
static bool sdhi_cmd53_issue(uint32_t arg, uint32_t cmd, uint32_t * p_r5,
                             uint32_t * p_sdsts1, uint32_t * p_sdsts2)
{
    bool ok;
    sdhi_get_resp_t resp = {0};

    (void)R_SDHI_ClearSdstsReg(SDHI_CH0, SDHI_SDIMSK1_TRNS_RESP, SDHI_SDIMSK2_CLEAR);
    if (!sdhi_wait_command_ready())
    {
        (void)R_SDHI_InReg(SDHI_CH0, SDHI_SDSTS1, p_sdsts1);
        (void)R_SDHI_InReg(SDHI_CH0, SDHI_SDSTS2, p_sdsts2);
        return false;
    }

    (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDARG, arg);
    (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDCMD, cmd);

    ok = sdhi_wait_status(SDHI_SDSTS1_RSPEND, 0U, p_sdsts1, p_sdsts2);
    (void)R_SDHI_GetResp(SDHI_CH0, &resp);
    *p_r5 = resp.sdrsp10;
    return ok;
}

/*
 * CMD53 byte-mode read: transfer up to 512 bytes from one IO function into
 * p_data. SDSIZE holds the byte count; after the command the receive buffer
 * fills (SDSTS2.RE), then it is drained 32-bit-word at a time from SDBUFR, and
 * the transfer ends on SDSTS1.ACEND.
 */
static bool sdio_cmd53_read_bytes(uint8_t function, uint32_t address, bool increment,
                                  uint8_t * p_data, uint32_t length, uint32_t * p_r5)
{
    bool ok;
    uint32_t sdsts1 = 0U;
    uint32_t sdsts2 = 0U;
    uint32_t arg;
    uint32_t word = 0U;
    uint32_t byte_index;
    uint32_t word_index;
    uint32_t word_count = (length + 3UL) / 4UL;
    bool relaxed_read_crc = false;

    if ((0UL == length) || (512UL < length))
    {
        *p_r5 = 0U;
        return false;
    }

    arg = R_SDIO_MakeCmd53Arg(false, function, address, increment, false, length);

    (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDSTOP, SDHI_SDSTOP_INIT);
    (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDSIZE, length);
    (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDIOMD, SDHI_SDIOMD_INTEN);

    g_cmd53_diag_stage = 1U;
    g_cmd53_diag_data0 = 0U;
    ok = sdhi_cmd53_issue(arg, SDHI_CMD53_SINGLE_READ, p_r5, &sdsts1, &sdsts2);
    if (!ok)
    {
        uint32_t live1 = 0U;
        uint32_t live2 = 0U;

        (void)R_SDHI_InReg(SDHI_CH0, SDHI_SDSTS1, &live1);
        (void)R_SDHI_InReg(SDHI_CH0, SDHI_SDSTS2, &live2);
        if ((0U != (sdsts1 & SDHI_SDSTS1_RSPEND)) || (0U != (live1 & SDHI_SDSTS1_RSPEND)) ||
            sdhi_can_read_crc_error_block(sdsts2))
        {
            sdsts1 = live1;
            sdsts2 = live2;
            ok = true;
        }
    }
    if (!ok)
    {
        sdhi_cmd53_capture_diag(sdsts1, sdsts2, *p_r5);
        sdhi_cmd53_force_stop(&sdsts2);
        return false;
    }

    (void)R_SDHI_ClearSdstsReg(SDHI_CH0, SDHI_SDIMSK1_RESP, 0U);

    /* Wait for the receive buffer to fill (BRE = SDSTS2.RE). */
    g_cmd53_diag_stage = 2U;
    ok = sdhi_wait_status(0U, SDHI_SDIMSK2_RE, &sdsts1, &sdsts2);
    relaxed_read_crc = (!ok) && sdhi_can_read_crc_error_block(sdsts2);
    if (relaxed_read_crc)
    {
        ok = true;
    }
    if (!ok)
    {
        sdhi_cmd53_capture_diag(sdsts1, sdsts2, *p_r5);
        sdhi_cmd53_force_stop(&sdsts2);
        return false;
    }
    (void)R_SDHI_ClearSdstsReg(SDHI_CH0, 0U,
                               SDHI_SDIMSK2_RE | (relaxed_read_crc ? SDHI_SDSTS2_READ_CRC_ERR : 0U));

    byte_index = 0UL;
    for (word_index = 0UL; word_index < word_count; word_index++)
    {
        (void)R_SDHI_InReg(SDHI_CH0, SDHI_SDBUFR, &word);
        if (0UL == word_index)
        {
            g_cmd53_diag_data0 = word;
        }
        while ((byte_index < length) && (byte_index < ((word_index + 1UL) * 4UL)))
        {
            p_data[byte_index] = (uint8_t)(word >> ((byte_index & 0x03UL) * 8UL));
            byte_index++;
        }
    }

    g_cmd53_diag_stage = 3U;
    ok = sdhi_wait_status(SDHI_SDSTS1_ACEND, 0U, &sdsts1, &sdsts2);
    if ((!ok) && sdhi_can_accept_read_done_error(sdsts1, sdsts2))
    {
        ok = true;
    }
    if (!ok)
    {
        sdhi_cmd53_capture_diag(sdsts1, sdsts2, *p_r5);
        sdhi_cmd53_force_stop(&sdsts2);
    }
    (void)R_SDHI_ClearSdstsReg(SDHI_CH0, SDHI_SDSTS1_ACEND,
                               ok ? (sdsts2 & SDHI_SDSTS2_ERR_BITS) : 0U);
    if (ok)
    {
        g_cmd53_diag_stage = 0xFFU;
    }
    return ok;
}

/*
 * CMD53 byte-mode write: transfer up to 512 bytes from p_data to one IO
 * function. The transmit buffer is fed through the raw SDBUFR address (the
 * controller wants successive writes to the same word port), waiting on
 * SDSTS2.WE for buffer space and SDSTS1.ACEND for completion.
 */
static bool sdio_cmd53_write_bytes(uint8_t function, uint32_t address, bool increment,
                                   uint8_t * p_data, uint32_t length, uint32_t * p_r5)
{
    bool ok;
    uint32_t sdsts1 = 0U;
    uint32_t sdsts2 = 0U;
    uint32_t arg;
    uint32_t word;
    uint32_t byte_index;
    uint32_t word_index;
    uint32_t word_count = (length + 3UL) / 4UL;
    uint32_t buff_reg;
    volatile uint32_t * p_sdbufr;

    if ((0UL == length) || (512UL < length))
    {
        *p_r5 = 0U;
        return false;
    }

