HirokiIshiguro/iot-reference-rx/Projects/aws_wifi_rx671_ek/e2studio_ccrx/src/sdio_host.c
    if (SDHI_SUCCESS != R_SDHI_GetBuffRegAddress(SDHI_CH0, &buff_reg))
    {
        *p_r5 = 0U;
        return false;
    }
    p_sdbufr = (volatile uint32_t *)buff_reg;

    arg = R_SDIO_MakeCmd53Arg(true, function, address, increment, false, length);

    (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDSTOP, SDHI_SDSTOP_INIT);
    (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDSIZE, length);
    (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDIOMD, SDHI_SDIOMD_INTEN);

    ok = sdhi_cmd53_issue(arg, SDHI_CMD53_SINGLE_WRITE, p_r5, &sdsts1, &sdsts2);
    if (!ok)
    {
        sdhi_cmd53_force_stop(&sdsts2);
        return false;
    }

    (void)R_SDHI_ClearSdstsReg(SDHI_CH0, SDHI_SDIMSK1_RESP, 0U);

    /* Wait for the transmit buffer to accept data (BWE = SDSTS2.WE). */
    ok = sdhi_wait_status(0U, SDHI_SDIMSK2_WE, &sdsts1, &sdsts2);
    if (!ok)
    {
        sdhi_cmd53_force_stop(&sdsts2);
        return false;
    }
    (void)R_SDHI_ClearSdstsReg(SDHI_CH0, 0U, SDHI_SDIMSK2_WE);

    byte_index = 0UL;
    for (word_index = 0UL; word_index < word_count; word_index++)
    {
        word = 0UL;
        while ((byte_index < length) && (byte_index < ((word_index + 1UL) * 4UL)))
        {
            word |= ((uint32_t)p_data[byte_index]) << ((byte_index & 0x03UL) * 8UL);
            byte_index++;
        }
        p_sdbufr[0] = word;
    }

    ok = sdhi_wait_status(SDHI_SDSTS1_ACEND, 0U, &sdsts1, &sdsts2);
    if (!ok)
    {
        sdhi_cmd53_force_stop(&sdsts2);
    }
    (void)R_SDHI_ClearSdstsReg(SDHI_CH0, SDHI_SDSTS1_ACEND, 0U);
    (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDSTOP, SDHI_SDSTOP_INIT);
    return ok;
}

/* A backplane block read can finish with a read-CRC error flagged while the
 * data in the buffer is still valid (CYW43439 quirk). Treat that one specific
 * condition - buffer-read-ready set, the only SDSTS2 error is the read-CRC bit,
 * and SDERSTS1 confirms RDCRCE - as recoverable, like perf does. */
static bool sdhi_can_read_crc_error_block(uint32_t sdsts2)
{
    uint32_t sdersts1 = 0U;

    if (0U == (sdsts2 & SDHI_SDIMSK2_RE))
    {
        return false;
    }
    if (SDHI_SDSTS2_READ_CRC_ERR != (sdsts2 & SDHI_SDSTS2_ERR_BITS))
    {
        return false;
    }
    (void)R_SDHI_InReg(SDHI_CH0, SDHI_SDERSTS1, &sdersts1);
    return (0U != (sdersts1 & SDHI_SDERSTS1_RDCRCE));
}

/* A byte/block read may finish with ACEND set while SDSTS2 latches ILR after
 * SDBUFR was drained and SDERSTS1 still reports the CYW43439 read-CRC quirk.
 * Accept only that narrow final-state combination; timeouts or command/end
 * errors still fail. */
static bool sdhi_can_accept_read_done_error(uint32_t sdsts1, uint32_t sdsts2)
{
    uint32_t err_bits = sdsts2 & SDHI_SDSTS2_ERR_BITS;
    uint32_t sdersts1 = 0U;
    uint32_t sdersts2 = 0U;

    if (0U == (sdsts1 & SDHI_SDSTS1_ACEND))
    {
        return false;
    }
    if ((SDHI_SDSTS2_ILLEGAL_READ_ERR != err_bits) &&
        ((SDHI_SDSTS2_ILLEGAL_READ_ERR | SDHI_SDSTS2_READ_CRC_ERR) != err_bits))
    {
        return false;
    }

    (void)R_SDHI_InReg(SDHI_CH0, SDHI_SDERSTS1, &sdersts1);
    (void)R_SDHI_InReg(SDHI_CH0, SDHI_SDERSTS2, &sdersts2);
    return ((0U != (sdersts1 & SDHI_SDERSTS1_RDCRCE)) && (0U == sdersts2));
}

#if (SDIO_HOST_CMD53_XFER_ENGINE == SDIO_HOST_CMD53_XFER_DTC)
static sdhi_status_t sdio_cmd53_dtc_callback(void * p_context)
{
    (void)p_context;
    g_cmd53_dtc_count++;
    return SDHI_SUCCESS;
}

static bool sdio_cmd53_dtc_open_once(void)
{
    dtc_err_t ret;

    if (g_cmd53_dtc_opened)
    {
        return true;
    }

    ret = R_DTC_Open();
    if ((DTC_SUCCESS != ret) && (DTC_ERR_OPENED != ret))
    {
        g_cmd53_dtc_error = 0x01000000UL | (uint32_t)ret;
        return false;
    }

    if (SDHI_SUCCESS != R_SDHI_IntSDBuffCallback(SDHI_CH0, sdio_cmd53_dtc_callback))
    {
        g_cmd53_dtc_error = 0x02000000UL;
        return false;
    }

    g_cmd53_dtc_args.act_src = (dtc_activation_source_t)DTCE_SDHI_SBFAI;
    g_cmd53_dtc_args.chain_transfer_nr = 0U;
    g_cmd53_dtc_args.p_transfer_data = &g_cmd53_dtc_data;
    g_cmd53_dtc_args.p_data_cfg = &g_cmd53_dtc_cfg;

    g_cmd53_dtc_opened = true;
    return true;
}

static bool sdio_cmd53_dtc_is_eligible(const uint8_t * p_data, uint32_t block_size, uint32_t block_count)
{
    if (0U != (((uint32_t)p_data) & SDHI_ADDR_BOUNDARY))
    {
        g_cmd53_dtc_error = 0x10000000UL | (((uint32_t)p_data) & SDHI_ADDR_BOUNDARY);
        return false;
    }

    if ((0UL == block_count) || (65535UL < block_count) ||
        (0UL == block_size) || (0UL != (block_size & 0x03UL)) || (256UL < (block_size / 4UL)))
    {
        g_cmd53_dtc_error = 0x11000000UL | ((block_size & 0xffffUL) << 8) | (block_count & 0xffUL);
        return false;
    }

    return true;
}

static bool sdio_cmd53_dtc_prepare(bool write, uint8_t * p_data, uint32_t block_size, uint32_t block_count,
                                   uint32_t buff_reg)
{
    dtc_err_t ret;

    if (!sdio_cmd53_dtc_open_once())
    {
        return false;
    }

    memset(&g_cmd53_dtc_data, 0, sizeof(g_cmd53_dtc_data));
    memset(&g_cmd53_dtc_cfg, 0, sizeof(g_cmd53_dtc_cfg));

    g_cmd53_dtc_cfg.transfer_mode = DTC_TRANSFER_MODE_BLOCK;
    g_cmd53_dtc_cfg.data_size = DTC_DATA_SIZE_LWORD;
    g_cmd53_dtc_cfg.src_addr_mode = write ? DTC_SRC_ADDR_INCR : DTC_SRC_ADDR_FIXED;
    g_cmd53_dtc_cfg.chain_transfer_enable = DTC_CHAIN_TRANSFER_DISABLE;
    g_cmd53_dtc_cfg.chain_transfer_mode = DTC_CHAIN_TRANSFER_CONTINUOUSLY;
    g_cmd53_dtc_cfg.response_interrupt = DTC_INTERRUPT_AFTER_ALL_COMPLETE;
    g_cmd53_dtc_cfg.repeat_block_side = write ? DTC_REPEAT_BLOCK_DESTINATION : DTC_REPEAT_BLOCK_SOURCE;
    g_cmd53_dtc_cfg.dest_addr_mode = write ? DTC_DES_ADDR_FIXED : DTC_DES_ADDR_INCR;
    g_cmd53_dtc_cfg.source_addr = write ? (uint32_t)p_data : buff_reg;
    g_cmd53_dtc_cfg.dest_addr = write ? buff_reg : (uint32_t)p_data;
    g_cmd53_dtc_cfg.transfer_count = block_count;
    g_cmd53_dtc_cfg.block_size = (uint16_t)(block_size / 4UL);

    (void)R_SDHI_DisableIcuInt(SDHI_CH0, SDHI_HWINT_BUFFER);
    (void)R_DTC_Control(DTC_CMD_ACT_SRC_DISABLE, NULL, &g_cmd53_dtc_args);

    ret = R_DTC_Create(g_cmd53_dtc_args.act_src, &g_cmd53_dtc_data, &g_cmd53_dtc_cfg, 0U);
    if (DTC_SUCCESS != ret)
    {
        g_cmd53_dtc_error = 0x03000000UL | (uint32_t)ret;
        return false;
    }

