HirokiIshiguro/iot-reference-rx/Projects/aws_wifi_rx671_ek/e2studio_ccrx/src/sdio_host.c
    ret = R_DTC_Control(DTC_CMD_ACT_SRC_ENABLE, NULL, &g_cmd53_dtc_args);
    if (DTC_SUCCESS != ret)
    {
        g_cmd53_dtc_error = 0x04000000UL | (uint32_t)ret;
        return false;
    }

    ret = R_DTC_Control(DTC_CMD_DTC_START, NULL, NULL);
    if (DTC_SUCCESS != ret)
    {
        g_cmd53_dtc_error = 0x05000000UL | (uint32_t)ret;
        return false;
    }

    return true;
}

static bool sdio_cmd53_dtc_wait(uint32_t dtc_start_count, uint32_t * p_sdsts1, uint32_t * p_sdsts2)
{
    uint32_t timeout = SDIO_HOST_CMD53_DTC_WAIT_COUNT;

    while ((g_cmd53_dtc_count == dtc_start_count) && (0UL != timeout))
    {
        timeout--;
    }

    (void)R_SDHI_InReg(SDHI_CH0, SDHI_SDSTS1, p_sdsts1);
    (void)R_SDHI_InReg(SDHI_CH0, SDHI_SDSTS2, p_sdsts2);

    if (g_cmd53_dtc_count == dtc_start_count)
    {
        g_cmd53_dtc_error = 0x06000000UL | (*p_sdsts2 & 0xffffUL);
        return false;
    }

    if (0U != (*p_sdsts2 & SDHI_SDSTS2_ERR_BITS))
    {
        g_cmd53_dtc_error = 0x07000000UL | (*p_sdsts2 & 0xffffUL);
        return false;
    }

    return true;
}

static bool sdio_cmd53_try_transfer_blocks_dtc(bool write, uint8_t function, uint32_t address, bool increment,
                                               uint8_t * p_data, uint32_t block_count, uint32_t block_size,
                                               uint32_t length, uint32_t buff_reg, uint32_t cmd,
                                               uint32_t * p_r5, uint32_t * p_sdsts1, uint32_t * p_sdsts2,
                                               bool * p_used)
{
    bool ok;
    bool relaxed_read_crc;
    uint32_t arg;
    uint32_t live_sdsts1 = 0U;
    uint32_t live_sdsts2 = 0U;
    uint32_t dtc_start_count;
    uint32_t ready_mask = write ? SDHI_SDIMSK2_WE : SDHI_SDIMSK2_RE;

    *p_used = false;

    if (function != SDIO_HOST_CMD53_DTC_FUNCTION)
    {
        g_cmd53_dtc_fallback_count++;
        g_cmd53_dtc_fb_function_count++;
        return false;
    }

    if (((!write) && (0U == SDIO_HOST_CMD53_DTC_READ_ENABLE)) ||
        (write && (0U == SDIO_HOST_CMD53_DTC_WRITE_ENABLE)))
    {
        g_cmd53_dtc_fallback_count++;
        g_cmd53_dtc_fb_disabled_count++;
        return false;
    }

    if (length < SDIO_HOST_CMD53_DTC_MIN_BYTES)
    {
        g_cmd53_dtc_fallback_count++;
        g_cmd53_dtc_fb_small_count++;
        return false;
    }

    if (!sdio_cmd53_dtc_is_eligible(p_data, block_size, block_count))
    {
        g_cmd53_dtc_fallback_count++;
        g_cmd53_dtc_fb_ineligible_count++;
        return false;
    }

    if (!sdio_cmd53_dtc_prepare(write, p_data, block_size, block_count, buff_reg))
    {
        g_cmd53_dtc_fallback_count++;
        g_cmd53_dtc_fb_prepare_count++;
        return false;
    }

    g_cmd53_dtc_last_seq++;
    g_cmd53_dtc_last_ctrl = (write ? 1UL : 0UL) |
                            (((uint32_t)function) << 8) |
                            (increment ? (1UL << 16) : 0UL);
    g_cmd53_dtc_last_addr = address;
    g_cmd53_dtc_last_len = length;
    g_cmd53_dtc_last_blocks = ((block_size & 0xffffUL) << 16) | (block_count & 0xffffUL);
    g_cmd53_dtc_last_data = (uint32_t)p_data;
    g_cmd53_dtc_last_r5 = 0U;
    g_cmd53_dtc_last_s1 = 0U;
    g_cmd53_dtc_last_s2 = 0U;

    *p_used = true;
    arg = R_SDIO_MakeCmd53Arg(write, function, address, increment, true, block_count);

    (void)R_SDHI_ClearSdstsReg(SDHI_CH0, SDHI_SDIMSK1_TRNS_RESP | SDHI_SDSTS1_DETECT_BITS,
                               SDHI_SDIMSK2_CLEAR | ready_mask);
    (void)R_SDHI_ClearIntMask(SDHI_CH0, 0U, ready_mask);
    (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDSIZE, block_size);
    (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDSTOP, SDHI_SDSTOP_SEC_ENABLE);
    (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDBLKCNT, block_count);
    (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDIOMD, SDHI_SDIOMD_INTEN);
    (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDDMAEN, SDHI_SDDMAEN_DMASDRW);
    (void)R_SDHI_SetIntMask(SDHI_CH0, 0U, ready_mask);
    (void)R_SDHI_EnableIcuInt(SDHI_CH0, SDHI_HWINT_BUFFER);

    dtc_start_count = g_cmd53_dtc_count;
    g_cmd53_dtc_active = true;
    ok = sdhi_cmd53_issue(arg, cmd, p_r5, p_sdsts1, p_sdsts2);
    if ((!write) && (!ok))
    {
        (void)R_SDHI_InReg(SDHI_CH0, SDHI_SDSTS1, &live_sdsts1);
        (void)R_SDHI_InReg(SDHI_CH0, SDHI_SDSTS2, &live_sdsts2);
        if ((0U != (*p_sdsts1 & SDHI_SDSTS1_RSPEND)) ||
            (0U != (live_sdsts1 & SDHI_SDSTS1_RSPEND)) ||
            sdhi_can_read_crc_error_block(*p_sdsts2))
        {
            *p_sdsts1 = live_sdsts1;
            *p_sdsts2 = live_sdsts2;
            ok = true;
        }
    }

    if (ok)
    {
        (void)R_SDHI_ClearSdstsReg(SDHI_CH0, SDHI_SDIMSK1_RESP, 0U);
        ok = sdio_cmd53_dtc_wait(dtc_start_count, p_sdsts1, p_sdsts2);
        relaxed_read_crc = (!write) && (!ok) && sdhi_can_read_crc_error_block(*p_sdsts2);
        if (relaxed_read_crc)
        {
            ok = true;
        }
    }

    g_cmd53_dtc_active = false;
    (void)R_DTC_Control(DTC_CMD_ACT_SRC_DISABLE, NULL, &g_cmd53_dtc_args);

    if (ok)
    {
        uint32_t clear_mask = ready_mask;

        if ((!write) && (0U != ((*p_sdsts2) & SDHI_SDSTS2_READ_CRC_ERR)))
        {
            clear_mask |= SDHI_SDSTS2_READ_CRC_ERR;
        }
        (void)R_SDHI_ClearSdstsReg(SDHI_CH0, 0U, clear_mask);

        ok = sdhi_wait_status(SDHI_SDSTS1_ACEND, 0U, p_sdsts1, p_sdsts2);
        if ((!ok) && (!write) && sdhi_can_accept_read_done_error(*p_sdsts1, *p_sdsts2))
        {
            ok = true;
        }
        (void)R_SDHI_ClearSdstsReg(SDHI_CH0, SDHI_SDSTS1_ACEND,
                                   ok ? ((*p_sdsts2) & SDHI_SDSTS2_ERR_BITS) : 0U);
    }

    if (!ok)
    {
        g_cmd53_dtc_fail_count++;
        sdhi_cmd53_capture_diag(*p_sdsts1, *p_sdsts2, *p_r5);
        sdhi_cmd53_force_stop(p_sdsts2);
    }

    (void)R_SDHI_DisableIcuInt(SDHI_CH0, SDHI_HWINT_BUFFER);
    (void)R_SDHI_ClearIntMask(SDHI_CH0, 0U, ready_mask);
    (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDDMAEN, 0U);
    (void)R_SDHI_ClearSdstsReg(SDHI_CH0, 0U, SDHI_SDIMSK2_CLEAR | ready_mask);
    (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDSTOP, SDHI_SDSTOP_INIT);

    if (ok)
    {
        g_cmd53_dtc_ok_count++;
        g_cmd53_diag_stage = 0xFFU;
        g_cmd53_dtc_error = 0U;
    }
    g_cmd53_dtc_last_r5 = *p_r5;
    g_cmd53_dtc_last_s1 = *p_sdsts1;
    g_cmd53_dtc_last_s2 = *p_sdsts2;
    return ok;
}
#endif

#if (SDIO_HOST_CMD53_XFER_ENGINE == SDIO_HOST_CMD53_XFER_DMACA)
static void sdio_cmd53_dmaca_callback(void)
{
    dmaca_stat_t stat;

