HirokiIshiguro/iot-reference-rx/Projects/aws_wifi_rx671_ek/e2studio_ccrx/src/sdio_host.c
    g_cmd53_dmaca_count++;
    (void)R_DMACA_Control(SDIO_HOST_CMD53_DMACA_CH, DMACA_CMD_DTIF_STATUS_CLR, &stat);
}

static bool sdio_cmd53_dmaca_open_once(void)
{
    dmaca_return_t ret;

    if (g_cmd53_dmaca_opened)
    {
        return true;
    }

    ret = R_DMACA_Open(SDIO_HOST_CMD53_DMACA_CH);
    if ((DMACA_SUCCESS != ret) && (DMACA_SUCCESS_DTC_BUSY != ret))
    {
        g_cmd53_dmaca_error = 0x01000000UL | (uint32_t)ret;
        return false;
    }

    ret = R_DMACA_Control(SDIO_HOST_CMD53_DMACA_CH, DMACA_CMD_DISABLE, NULL);
    if (DMACA_SUCCESS != ret)
    {
        g_cmd53_dmaca_error = 0x02000000UL | (uint32_t)ret;
        return false;
    }

    ret = R_DMACA_Int_Callback(SDIO_HOST_CMD53_DMACA_CH, (void *)sdio_cmd53_dmaca_callback);
    if (DMACA_SUCCESS != ret)
    {
        g_cmd53_dmaca_error = 0x03000000UL | (uint32_t)ret;
        return false;
    }

    ret = R_DMACA_Control(SDIO_HOST_CMD53_DMACA_CH, DMACA_CMD_ALL_ENABLE, NULL);
    if (DMACA_SUCCESS != ret)
    {
        g_cmd53_dmaca_error = 0x03100000UL | (uint32_t)ret;
        return false;
    }

    g_cmd53_dmaca_opened = true;
    return true;
}

static bool sdio_cmd53_dmaca_is_eligible(const uint8_t * p_data, uint32_t block_size, uint32_t block_count)
{
    uint32_t transfer_words = (block_size * block_count) / 4UL;

    if (0U != (((uint32_t)p_data) & SDHI_ADDR_BOUNDARY))
    {
        g_cmd53_dmaca_error = 0x10000000UL | (((uint32_t)p_data) & SDHI_ADDR_BOUNDARY);
        return false;
    }

#if (SDIO_HOST_CMD53_DMACA_BLOCK_MODE != 0U)
    if ((0UL == block_count) || (65535UL < block_count) ||
        (0UL == block_size) || (0UL != (block_size & 0x03UL)) || (1024UL < (block_size / 4UL)))
    {
        g_cmd53_dmaca_error = 0x11000000UL | ((block_size & 0xffffUL) << 8) | (block_count & 0xffUL);
        return false;
    }
#else
    if ((0UL == transfer_words) || (65535UL < transfer_words) ||
        (0UL == block_size) || (0UL != (block_size & 0x03UL)))
    {
        g_cmd53_dmaca_error = 0x11000000UL | ((block_size & 0xffffUL) << 8) | (block_count & 0xffUL);
        return false;
    }
#endif

    return true;
}

static bool sdio_cmd53_dmaca_prepare(bool write, uint8_t * p_data, uint32_t block_size, uint32_t block_count,
                                     uint32_t buff_reg)
{
    dmaca_return_t ret;
    dmaca_stat_t stat;

    if (!sdio_cmd53_dmaca_open_once())
    {
        return false;
    }

    memset(&g_cmd53_dmaca_cfg, 0, sizeof(g_cmd53_dmaca_cfg));
#if (SDIO_HOST_CMD53_DMACA_BLOCK_MODE != 0U)
    g_cmd53_dmaca_cfg.transfer_mode = DMACA_TRANSFER_MODE_BLOCK;
    g_cmd53_dmaca_cfg.repeat_block_side = write ? DMACA_REPEAT_BLOCK_DESTINATION : DMACA_REPEAT_BLOCK_SOURCE;
#else
    g_cmd53_dmaca_cfg.transfer_mode = DMACA_TRANSFER_MODE_NORMAL;
    g_cmd53_dmaca_cfg.repeat_block_side = DMACA_REPEAT_BLOCK_DISABLE;
#endif
    g_cmd53_dmaca_cfg.data_size = DMACA_DATA_SIZE_LWORD;
    g_cmd53_dmaca_cfg.act_source = (dmaca_activation_source_t)DTCE_SDHI_SBFAI;
    g_cmd53_dmaca_cfg.request_source = DMACA_TRANSFER_REQUEST_PERIPHERAL;
    g_cmd53_dmaca_cfg.dtie_request = DMACA_TRANSFER_END_INTERRUPT_ENABLE;
    g_cmd53_dmaca_cfg.esie_request = DMACA_TRANSFER_ESCAPE_END_INTERRUPT_DISABLE;
    g_cmd53_dmaca_cfg.rptie_request = DMACA_REPEAT_SIZE_END_INTERRUPT_DISABLE;
    g_cmd53_dmaca_cfg.sarie_request = DMACA_SRC_ADDR_EXT_REP_AREA_OVER_INTERRUPT_DISABLE;
    g_cmd53_dmaca_cfg.darie_request = DMACA_DES_ADDR_EXT_REP_AREA_OVER_INTERRUPT_DISABLE;
    g_cmd53_dmaca_cfg.src_addr_mode = write ? DMACA_SRC_ADDR_INCR : DMACA_SRC_ADDR_FIXED;
    g_cmd53_dmaca_cfg.src_addr_repeat_area = DMACA_SRC_ADDR_EXT_REP_AREA_NONE;
    g_cmd53_dmaca_cfg.des_addr_mode = write ? DMACA_DES_ADDR_FIXED : DMACA_DES_ADDR_INCR;
    g_cmd53_dmaca_cfg.des_addr_repeat_area = DMACA_DES_ADDR_EXT_REP_AREA_NONE;
    g_cmd53_dmaca_cfg.offset_value = 0U;
    g_cmd53_dmaca_cfg.interrupt_sel = DMACA_CLEAR_INTERRUPT_FLAG_BEGINNING_TRANSFER;
    g_cmd53_dmaca_cfg.p_src_addr = write ? (void *)p_data : (void *)buff_reg;
    g_cmd53_dmaca_cfg.p_des_addr = write ? (void *)buff_reg : (void *)p_data;
#if (SDIO_HOST_CMD53_DMACA_BLOCK_MODE != 0U)
    g_cmd53_dmaca_cfg.transfer_count = block_count;
#else
    g_cmd53_dmaca_cfg.transfer_count = (block_size * block_count) / 4UL;
#endif
    g_cmd53_dmaca_cfg.block_size = (uint16_t)(block_size / 4UL);

    (void)R_SDHI_DisableIcuInt(SDHI_CH0, SDHI_HWINT_BUFFER);
    (void)R_DMACA_Control(SDIO_HOST_CMD53_DMACA_CH, DMACA_CMD_DISABLE, &stat);
    (void)R_DMACA_Control(SDIO_HOST_CMD53_DMACA_CH, DMACA_CMD_DTIF_STATUS_CLR, &stat);
    (void)R_DMACA_Int_Disable(SDIO_HOST_CMD53_DMACA_CH);

    ret = R_DMACA_Create(SDIO_HOST_CMD53_DMACA_CH, &g_cmd53_dmaca_cfg);
    if (DMACA_SUCCESS != ret)
    {
        g_cmd53_dmaca_error = 0x04000000UL | (uint32_t)ret;
        return false;
    }

    ret = R_DMACA_Int_Enable(SDIO_HOST_CMD53_DMACA_CH, SDIO_HOST_CMD53_DMACA_INT_LEVEL);
    if (DMACA_SUCCESS != ret)
    {
        g_cmd53_dmaca_error = 0x05000000UL | (uint32_t)ret;
        return false;
    }

    return true;
}

static bool sdio_cmd53_dmaca_wait(uint32_t dmaca_start_count, uint32_t * p_sdsts1, uint32_t * p_sdsts2)
{
    uint32_t timeout = SDIO_HOST_CMD53_DMACA_WAIT_COUNT;
    dmaca_stat_t stat;
    dmaca_return_t ret;

    while ((g_cmd53_dmaca_count == dmaca_start_count) && (0UL != timeout))
    {
        ret = R_DMACA_Control(SDIO_HOST_CMD53_DMACA_CH, DMACA_CMD_STATUS_GET, &stat);
        if ((DMACA_SUCCESS == ret) && stat.dtif_stat)
        {
            g_cmd53_dmaca_count++;
            (void)R_DMACA_Control(SDIO_HOST_CMD53_DMACA_CH, DMACA_CMD_DTIF_STATUS_CLR, &stat);
            break;
        }
        timeout--;
    }

    (void)R_SDHI_InReg(SDHI_CH0, SDHI_SDSTS1, p_sdsts1);
    (void)R_SDHI_InReg(SDHI_CH0, SDHI_SDSTS2, p_sdsts2);

    if (g_cmd53_dmaca_count == dmaca_start_count)
    {
        g_cmd53_dmaca_error = 0x06000000UL | (*p_sdsts2 & 0xffffUL);
        return false;
    }

    if (0U != (*p_sdsts2 & SDHI_SDSTS2_ERR_BITS))
    {
        g_cmd53_dmaca_error = 0x07000000UL | (*p_sdsts2 & 0xffffUL);
        return false;
    }

