HirokiIshiguro/iot-reference-rx/Projects/aws_wifi_rx671_ek/e2studio_ccrx/src/sdio_host.c
#if (SDIO_HOST_CMD53_XFER_ENGINE == SDIO_HOST_CMD53_XFER_DTC)
    {
        bool dma_used = false;

        ok = sdio_cmd53_try_transfer_blocks_dtc(write, function, address, increment,
                                                p_data, block_count, block_size, length,
                                                buff_reg, cmd, p_r5, &sdsts1, &sdsts2,
                                                &dma_used);
        if (dma_used)
        {
            return ok;
        }
    }
#elif (SDIO_HOST_CMD53_XFER_ENGINE == SDIO_HOST_CMD53_XFER_DMACA)
    {
        bool dma_used = false;

        ok = sdio_cmd53_try_transfer_blocks_dmaca(write, function, address, increment,
                                                  p_data, block_count, block_size, length,
                                                  buff_reg, cmd, p_r5, &sdsts1, &sdsts2,
                                                  &dma_used);
        if (dma_used)
        {
            return ok;
        }
    }
#endif

    (void)R_SDHI_ClearSdstsReg(SDHI_CH0, SDHI_SDIMSK1_TRNS_RESP | SDHI_SDSTS1_DETECT_BITS,
                               SDHI_SDIMSK2_CLEAR | ready_mask);
    (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDSIZE, block_size);
    (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDSTOP, SDHI_SDSTOP_SEC_ENABLE);
    (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDBLKCNT, block_count);
    (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDIOMD, SDHI_SDIOMD_INTEN);

    g_cmd53_diag_stage = 1U;
    g_cmd53_diag_data0 = 0U;
    ok = sdhi_cmd53_issue(arg, cmd, p_r5, &sdsts1, &sdsts2);
    /* A read that the command engine flagged can still carry good data if RSPEND
     * was seen or only a read-CRC error is set. */
    if ((!write) && (!ok))
    {
        uint32_t live1 = 0U;
        uint32_t live2 = 0U;

        (void)R_SDHI_InReg(SDHI_CH0, SDHI_SDSTS1, &live1);
        (void)R_SDHI_InReg(SDHI_CH0, SDHI_SDSTS2, &live2);
        if ((0U != (sdsts1 & SDHI_SDSTS1_RSPEND)) || (0U != (live1 & SDHI_SDSTS1_RSPEND)) ||
            sdhi_can_read_crc_error_block(sdsts2))
        {
            sdsts1 = live1;
            sdsts2 = live2;
            ok = true;
        }
    }
    if (!ok)
    {
        sdhi_cmd53_capture_diag(sdsts1, sdsts2, *p_r5);
        sdhi_cmd53_force_stop(&sdsts2);
        (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDSTOP, SDHI_SDSTOP_INIT);
        return false;
    }

    (void)R_SDHI_ClearSdstsReg(SDHI_CH0, SDHI_SDIMSK1_RESP, 0U);

    g_cmd53_diag_stage = 2U;
    for (block_index = 0UL; block_index < block_count; block_index++)
    {
        ok = sdhi_wait_status(0U, ready_mask, &sdsts1, &sdsts2);
        relaxed_read_crc = (!write) && (!ok) && sdhi_can_read_crc_error_block(sdsts2);
        if (relaxed_read_crc)
        {
            ok = true;
        }
        if (!ok)
        {
            sdhi_cmd53_capture_diag(sdsts1, sdsts2, *p_r5);
            break;
        }

        clear_mask = ready_mask;
        if (relaxed_read_crc)
        {
            clear_mask |= SDHI_SDSTS2_READ_CRC_ERR;
        }
        (void)R_SDHI_ClearSdstsReg(SDHI_CH0, 0U, clear_mask);

        byte_index = block_index * block_size;
        for (word_index = 0UL; word_index < (block_size / 4UL); word_index++)
        {
            if (write)
            {
                word = ((uint32_t)p_data[byte_index]) |
                       ((uint32_t)p_data[byte_index + 1UL] << 8) |
                       ((uint32_t)p_data[byte_index + 2UL] << 16) |
                       ((uint32_t)p_data[byte_index + 3UL] << 24);
                p_sdbufr[0] = word;
            }
            else
            {
                (void)R_SDHI_InReg(SDHI_CH0, SDHI_SDBUFR, &word);
                if ((0UL == block_index) && (0UL == word_index))
                {
                    g_cmd53_diag_data0 = word;
                }
                p_data[byte_index]       = (uint8_t)word;
                p_data[byte_index + 1UL] = (uint8_t)(word >> 8);
                p_data[byte_index + 2UL] = (uint8_t)(word >> 16);
                p_data[byte_index + 3UL] = (uint8_t)(word >> 24);
            }
            byte_index += 4UL;
        }
    }

    if (ok)
    {
        g_cmd53_diag_stage = 3U;
        ok = sdhi_wait_status(SDHI_SDSTS1_ACEND, 0U, &sdsts1, &sdsts2);
        if ((!ok) && (!write) && sdhi_can_accept_read_done_error(sdsts1, sdsts2))
        {
            ok = true;
        }
        if (!ok)
        {
            sdhi_cmd53_capture_diag(sdsts1, sdsts2, *p_r5);
        }
        (void)R_SDHI_ClearSdstsReg(SDHI_CH0, SDHI_SDSTS1_ACEND,
                                   ok ? (sdsts2 & SDHI_SDSTS2_ERR_BITS) : 0U);
    }

    if (!ok)
    {
        sdhi_cmd53_force_stop(&sdsts2);
    }
    (void)R_SDHI_OutReg(SDHI_CH0, SDHI_SDSTOP, SDHI_SDSTOP_INIT);
    if (ok)
    {
        g_cmd53_diag_stage = 0xFFU;
    }
    return ok;
}

/* Host-side CMD53: byte mode bridges to the byte primitives, block mode to the
 * block transfer. Both go through the same r_sdio_rx callback. */
static sdio_err_t sdio_rx_cmd53_callback(void * p_context, sdio_cmd53_t * p_args)
{
    bool ok;
    uint32_t r5 = 0U;

    (void)p_context;
    if ((NULL == p_args) || (NULL == p_args->p_data))
    {
        return SDIO_ERR_NULL_PTR;
    }

    if (p_args->block_mode)
    {
        ok = sdio_cmd53_transfer_blocks(p_args->write, p_args->function, p_args->address,
                                        p_args->increment, p_args->p_data, p_args->count, &r5);
    }
    else if (p_args->write)
    {
        ok = sdio_cmd53_write_bytes(p_args->function, p_args->address, p_args->increment,
                                    p_args->p_data, p_args->count, &r5);
    }
    else
    {
        ok = sdio_cmd53_read_bytes(p_args->function, p_args->address, p_args->increment,
                                   p_args->p_data, p_args->count, &r5);
    }

    p_args->r5 = r5;
    return ok ? SDIO_SUCCESS : SDIO_ERR_HOST;
}

static void sdio_rx_delay_ms(void * p_context, uint32_t delay_ms)
{
    (void)p_context;
    R_BSP_SoftwareDelay(delay_ms, BSP_DELAY_MILLISECS);
}

