HirokiIshiguro/iot-reference-rx/Projects/aws_wifi_rx671_ek/e2studio_ccrx/src/sdio_host.c
bool sdio_host_protocol_open(void)
{
    if (g_sdio_ctrl.open)
    {
        (void)R_SDIO_Close(&g_sdio_ctrl);
    }

    g_sdio_cfg.p_context           = NULL;
    g_sdio_cfg.p_cmd52             = sdio_rx_cmd52_callback;
    g_sdio_cfg.p_cmd53             = sdio_rx_cmd53_callback;
    g_sdio_cfg.p_delay_ms          = sdio_rx_delay_ms;
    g_sdio_cfg.io_ready_poll_count = 100000UL;

    return (SDIO_SUCCESS == R_SDIO_Open(&g_sdio_ctrl, &g_sdio_cfg));
}

bool sdio_host_cmd52_read(uint8_t function, uint32_t address, uint8_t * p_data)
{
    uint32_t r5 = 0U;
    return (SDIO_SUCCESS == R_SDIO_Cmd52Read(&g_sdio_ctrl, function, address, p_data, &r5));
}

bool sdio_host_enable_function(uint8_t function, uint8_t * p_ready)
{
    uint32_t r5 = 0U;
    return (SDIO_SUCCESS == R_SDIO_EnableFunction(&g_sdio_ctrl, function, p_ready, &r5));
}

bool sdio_host_cmd52_write(uint8_t function, uint32_t address, uint8_t data, uint8_t * p_readback)
{
    uint32_t r5 = 0U;
    return (SDIO_SUCCESS == R_SDIO_Cmd52Write(&g_sdio_ctrl, function, address, data, true, p_readback, &r5));
}

bool sdio_host_abort_function(uint8_t function)
{
    uint8_t readback = 0U;

    if (function > 7U)
    {
        return false;
    }

    return sdio_host_cmd52_write(0U, SDIO_CCCR_IO_ABORT, function, &readback);
}

/*
 * Enable SDIO high speed if the card supports it (CCCR 0x13: SHS = support,
 * EHS = enable). Part of the perf project's proven pre-CMD53 sequence.
 */
bool sdio_host_set_high_speed(void)
{
    uint8_t speed = 0U;
    uint8_t readback = 0U;

    g_sdio_high_speed_enabled = false;

    if (!sdio_host_cmd52_read(0U, SDIO_CCCR_HIGH_SPEED, &speed))
    {
        return false;
    }
    if (0U != (speed & SDIO_HIGH_SPEED_SHS))
    {
        if (!sdio_host_cmd52_write(0U, SDIO_CCCR_HIGH_SPEED, (uint8_t)(speed | SDIO_HIGH_SPEED_EHS), &readback))
        {
            return false;
        }
        g_sdio_high_speed_enabled = (0U != (readback & SDIO_HIGH_SPEED_EHS));
    }
    return true;
}

static bool sdio_host_set_one_block_size(uint8_t function, uint16_t block_size)
{
    uint32_t base = (uint32_t)function << 8;
    uint8_t readback = 0U;

    if (!sdio_host_cmd52_write(0U, base + SDIO_FBR_BLKSIZ0, (uint8_t)block_size, &readback))
    {
        return false;
    }
    if (!sdio_host_cmd52_write(0U, base + SDIO_FBR_BLKSIZ1, (uint8_t)(block_size >> 8), &readback))
    {
        return false;
    }

    if (function <= SDIO_MAX_FUNCTION)
    {
        g_sdio_block_size[function] = block_size;
    }
    return true;
}

/*
 * Set the F0 and F1 SDIO block sizes (CYW43439 uses 64). Part of the perf
 * project's proven pre-CMD53 sequence.
 */
bool sdio_host_set_block_size(void)
{
    return sdio_host_set_one_block_size(0U, 64U) && sdio_host_set_one_block_size(1U, 64U);
}

/*
 * Mirror a CMD52 write into g_sdio_block_size when it targets a function's
 * block-size register, so block-mode CMD53 on that function uses the size the
 * upper layer actually programmed. The block-size registers live in the
 * function-0 (CIA) address space: F0 at CCCR 0x10/0x11 and Fn at FBRn + 0x10/
 * 0x11 = (n << 8) + 0x10/0x11, the LSB at 0x10 and the MSB at 0x11. WHD programs
 * F0/F1/F2 here directly (BUS_FUNCTION = 0) rather than through
 * sdio_host_set_block_size, which seeds only F0/F1; without this, g_sdio_block_size[2]
 * stays 0 and sdio_cmd53_transfer_blocks rejects the F2/WLAN block transfers.
 */
void sdio_host_note_cmd52_write(uint8_t function, uint32_t address, uint8_t value)
{
    uint8_t target;
    uint8_t reg;

    /* FBR/CCCR (block-size) registers are addressed through function 0. */
    if (0U != function)
    {
        return;
    }

    target = (uint8_t)((address >> 8) & 0x07U);
    reg = (uint8_t)(address & 0xFFU);
    if (SDIO_FBR_BLKSIZ0 == reg)
    {
        g_sdio_block_size[target] = (uint16_t)((g_sdio_block_size[target] & 0xFF00U) | value);
    }
    else if (SDIO_FBR_BLKSIZ1 == reg)
    {
        g_sdio_block_size[target] = (uint16_t)((g_sdio_block_size[target] & 0x00FFU) | ((uint16_t)value << 8));
    }
    else
    {
        /* Not a block-size register; nothing to mirror. */
    }
}

/*
 * Switch the SDIO bus to 4-bit before any CMD53 data transfer. The card
 * enumerates and answers CMD52 in its 1-bit default; the perf project's proven
 * data path runs 4-bit (CCCR bus interface control: clear the width field, set
 * 4-bit, disable the DAT3 card-detect pull-up so DAT3 is a data line), then
 * switches the SDHI to 4-bit and re-applies the transfer pins.
 */
bool sdio_host_set_bus_4bit(void)
{
    uint8_t bus_if = 0U;
    uint8_t new_bus_if;
    uint8_t readback = 0U;

    if (!sdio_host_cmd52_read(0U, SDIO_CCCR_BUS_IF_CONTROL, &bus_if))
    {
        return false;
    }

    new_bus_if = (uint8_t)((bus_if & (uint8_t)(~SDIO_BUS_WIDTH_MASK)) |
                           SDIO_BUS_WIDTH_4BIT | SDIO_BUS_CD_DISABLE);
    if (!sdio_host_cmd52_write(0U, SDIO_CCCR_BUS_IF_CONTROL, new_bus_if, &readback))
    {
        return false;
    }

    if (SDHI_SUCCESS != R_SDHI_SetBus(SDHI_CH0, SDHI_PORT_4BIT))
    {
        return false;
    }
    R_SDHI_PinSetTransfer();
    return true;
}

/*
 * Raise the SDHI clock from the ~400 kHz identification divider used for
 * enumerate. SDIO_HOST_CFG_RUN_CLOCK_DIV selects the stable run divider.
 * Defining SDIO_HOST_USE_HIGH_SPEED_CLOCK enables the 30 MHz DIV_2 path after
 * CCCR EHS is observed; on this bench that path is kept explicit because it can
 * break early CMD53 transfers.
 */
bool sdio_host_set_run_clock(void)
{
    sdhi_status_t status;
#if defined(SDIO_HOST_USE_HIGH_SPEED_CLOCK)
    uint32_t div = g_sdio_high_speed_enabled ? SDHI_CFG_DIV_HIGH_SPEED : SDHI_CFG_DIV_DEFAULT_SPEED;
#else
    uint32_t div = (uint32_t)SDIO_HOST_CFG_RUN_CLOCK_DIV;

    (void)g_sdio_high_speed_enabled;
#endif

    g_sdio_host_run_clock_div = div;
    status = R_SDHI_SetClock(SDHI_CH0, div, SDHI_CLOCK_ENABLE);
    g_sdio_host_run_clock_status = (uint32_t)status;

    return (SDHI_SUCCESS == status);
}

