HirokiIshiguro/iot-reference-rx/Projects/aws_wifi_rx671_ek/e2studio_ccrx/src/sdio_host.c
/*
 * Request the ALP backplane clock (F1 CHIPCLKCSR), poll for ALP_AVAIL. This
 * sets the ALP_AVAIL status bit but is NOT sufficient on its own to clock the
 * backplane data phase - sdio_host_brcm_force_clocks() must follow. Writes the
 * final CSR byte.
 */
bool sdio_host_request_alp(uint8_t * p_csr)
{
    uint8_t readback = 0U;
    uint8_t csr = 0U;
    uint32_t poll;

    if (!sdio_host_cmd52_write(1U, SDIO_BRCM_FUNC1_CHIPCLKCSR, SDIO_BRCM_CLK_ALP_REQ, &readback))
    {
        return false;
    }

    for (poll = 0UL; poll < 100000UL; poll++)
    {
        if (!sdio_host_cmd52_read(1U, SDIO_BRCM_FUNC1_CHIPCLKCSR, &csr))
        {
            return false;
        }
        if (0U != (csr & SDIO_BRCM_ALP_AVAIL))
        {
            if (NULL != p_csr)
            {
                *p_csr = csr;
            }
            return true;
        }
        R_BSP_SoftwareDelay(1U, BSP_DELAY_MILLISECS);
    }

    if (NULL != p_csr)
    {
        *p_csr = csr;
    }
    return false;
}

/*
 * Force the backplane clocks exactly as perf does before its first CMD53
 * backplane read (verified byte-for-byte against a known-good perf run on this
 * bench):
 *   1. FORCE_ALP  - force ALP on, not just request it
 *   2. WAKEUPCTRL - set WAKE_TILL_HT so the WLAN core stays awake until HT
 *   3. FORCE_HT   - force HT, and do NOT wait for HT_AVAIL (it does not come up
 *                   pre-firmware; perf proceeds at CHIPCLKCSR=0x42)
 * Requesting ALP alone (ALP_AVAIL status set) does NOT clock the backplane data
 * phase - this was the missing precondition behind the CMD53 stall (the card
 * ACKs CMD53 but never clocks data, SDSTS2 stuck CBSY / RE never asserts).
 * Writes the final CHIPCLKCSR byte. Call after sdio_host_request_alp().
 */
bool sdio_host_brcm_force_clocks(uint8_t * p_csr)
{
    uint8_t readback = 0U;
    uint8_t wctrl = 0U;

    if (!sdio_host_cmd52_write(1U, SDIO_BRCM_FUNC1_CHIPCLKCSR, SDIO_BRCM_CLK_FORCE_ALP, &readback))
    {
        return false;
    }

    if (!sdio_host_cmd52_read(1U, SDIO_BRCM_FUNC1_WAKEUPCTRL, &wctrl))
    {
        return false;
    }
    if (!sdio_host_cmd52_write(1U, SDIO_BRCM_FUNC1_WAKEUPCTRL,
                               (uint8_t)(wctrl | SDIO_BRCM_WCTRL_WAKE_TILL_HT), &readback))
    {
        return false;
    }

    if (!sdio_host_cmd52_write(1U, SDIO_BRCM_FUNC1_CHIPCLKCSR, SDIO_BRCM_FORCE_HT, &readback))
    {
        return false;
    }

    if (NULL != p_csr)
    {
        *p_csr = readback;
    }
    return true;
}

/*
 * Keep the WLAN SDIO core on (KSO). Write SLEEPCSR (F1 0x1001f) with KEEP_WL_KSO
 * twice (the second write sticks once the core is up), then poll until KEEP_WL_
 * KSO reads back. perf does this before backplane reads. Writes the final
 * SLEEPCSR byte.
 */
bool sdio_host_request_kso(uint8_t * p_slp)
{
    uint8_t readback = 0U;
    uint8_t slp = 0U;
    uint32_t poll;

    (void)sdio_host_cmd52_write(1U, SDIO_BRCM_FUNC1_SLEEPCSR, SDIO_BRCM_SLPCSR_KEEP_WL_KSO, &readback);
    (void)sdio_host_cmd52_write(1U, SDIO_BRCM_FUNC1_SLEEPCSR, SDIO_BRCM_SLPCSR_KEEP_WL_KSO, &readback);

    for (poll = 0UL; poll < 2000UL; poll++)
    {
        if (!sdio_host_cmd52_read(1U, SDIO_BRCM_FUNC1_SLEEPCSR, &slp))
        {
            return false;
        }
        if (0U != (slp & SDIO_BRCM_SLPCSR_KEEP_WL_KSO))
        {
            if (NULL != p_slp)
            {
                *p_slp = slp;
            }
            return true;
        }
        R_BSP_SoftwareDelay(1U, BSP_DELAY_MILLISECS);
    }

    if (NULL != p_slp)
    {
        *p_slp = slp;
    }
    return false;
}

/*
 * Read a 32-bit little-endian word from the Broadcom backplane (sets the SB
 * window via CMD52, then a 4-byte CMD53 byte read through r_sdio_rx). This is
 * the first user of the CMD53 data path: a backplane read of the chipcommon
 * base returns the chip ID, proving the host data phase end to end.
 */
bool sdio_host_backplane_read32(uint32_t address, uint32_t * p_value)
{
    uint32_t r5 = 0U;
    uint8_t data[4] = {0U, 0U, 0U, 0U};

    if (NULL == p_value)
    {
        return false;
    }

    if (SDIO_SUCCESS != R_SDIO_BrcmBackplaneRead(&g_sdio_ctrl, address, true, data, 4U, &r5))
    {
        return false;
    }

    *p_value = ((uint32_t)data[0]) | ((uint32_t)data[1] << 8) |
               ((uint32_t)data[2] << 16) | ((uint32_t)data[3] << 24);
    return true;
}

bool sdio_host_backplane_read(uint32_t address, uint8_t * p_data, uint32_t length)
{
    uint32_t r5 = 0U;

    if ((NULL == p_data) || (0U == length))
    {
        return false;
    }

    return (SDIO_SUCCESS == R_SDIO_BrcmBackplaneRead(&g_sdio_ctrl, address, true, p_data, length, &r5));
}

/*
 * Read block_count blocks (of the F1 block size) from the Broadcom backplane via
 * the CMD53 block-mode path: set the SB window, then R_SDIO_Cmd53ReadBlocks on
 * F1. Exercises the block transfer that the firmware download will use.
 */
bool sdio_host_backplane_read_block(uint32_t address, uint8_t * p_data, uint32_t block_count)
{
    uint32_t r5 = 0U;
    uint32_t f1_address;
    uint32_t length = (uint32_t)g_sdio_block_size[1] * block_count;

    if ((NULL == p_data) || (0U == block_count))
    {
        return false;
    }

    if (SDIO_SUCCESS != R_SDIO_BrcmSetBackplaneWindow(&g_sdio_ctrl, address, NULL, &r5))
    {
        return false;
    }
    f1_address = R_SDIO_BrcmBackplaneFunctionAddress(address, length);
    return (SDIO_SUCCESS == R_SDIO_Cmd53ReadBlocks(&g_sdio_ctrl, 1U, f1_address, true,
                                                   p_data, block_count, &r5));
}

bool sdio_host_backplane_write(uint32_t address, uint8_t * p_data, uint32_t length)
{
    uint32_t r5 = 0U;

    if ((NULL == p_data) || (0U == length))
    {
        return false;
    }
    return (SDIO_SUCCESS == R_SDIO_BrcmBackplaneWrite(&g_sdio_ctrl, address, true, p_data, length, &r5));
}

bool sdio_host_backplane_write_block(uint32_t address, uint8_t * p_data, uint32_t block_count)
{
    uint32_t r5 = 0U;
    uint32_t f1_address;
    uint32_t length = (uint32_t)g_sdio_block_size[1] * block_count;

    if ((NULL == p_data) || (0U == block_count))
    {
        return false;
    }
    if (SDIO_SUCCESS != R_SDIO_BrcmSetBackplaneWindow(&g_sdio_ctrl, address, NULL, &r5))
    {
        return false;
    }
    f1_address = R_SDIO_BrcmBackplaneFunctionAddress(address, length);
    return (SDIO_SUCCESS == R_SDIO_Cmd53WriteBlocks(&g_sdio_ctrl, 1U, f1_address, true,
                                                    p_data, block_count, &r5));
}

/* Raw CMD53 (no backplane windowing) for the WHD SDIO bus backend. The WHD bus
 * driver owns the Broadcom backplane window (it programs SBADDR* via CMD52), so
 * this issues the CMD53 to the function/address exactly as asked. count is bytes
 * in byte mode, blocks in block mode. Writes the R5 response (p_r5 may be NULL).
 * This is the primitive cyhal_sdio_bulk_transfer maps onto. */
bool sdio_host_cmd53(bool write, uint8_t function, uint32_t address, bool increment,
                     bool block_mode, uint8_t * p_data, uint32_t count, uint32_t * p_r5)
{
    uint32_t r5 = 0U;
    sdio_err_t err;

    if ((NULL == p_data) || (0U == count))
    {
        if (NULL != p_r5)
        {
            *p_r5 = 0U;
        }
        return false;
    }

    if (block_mode)
    {
        err = write
            ? R_SDIO_Cmd53WriteBlocks(&g_sdio_ctrl, function, address, increment, p_data, count, &r5)
            : R_SDIO_Cmd53ReadBlocks(&g_sdio_ctrl, function, address, increment, p_data, count, &r5);
    }
    else
    {
        err = write
            ? R_SDIO_Cmd53WriteBytes(&g_sdio_ctrl, function, address, increment, p_data, count, &r5)
            : R_SDIO_Cmd53ReadBytes(&g_sdio_ctrl, function, address, increment, p_data, count, &r5);
    }

