HirokiIshiguro/iot-reference-rx/Projects/aws_wifi_rx671_ek/e2studio_ccrx/src/sdio_host.c
    if (NULL != p_r5)
    {
        *p_r5 = r5;
    }
    return (SDIO_SUCCESS == err);
}

/* ---- Broadcom core control (firmware-download bring-up) --------------------
 *
 * The CYW43439 ARM (WLAN CPU) and SOCRAM cores are reset/clocked through their
 * AI wrapper registers (IOCTRL / RESETCTRL), accessed over the backplane. The
 * firmware download halts the ARM, resets SOCRAM, loads the blob into RAM, then
 * releases the ARM to boot. */
static bool brcm_bp_write8(uint32_t address, uint8_t value)
{
    uint32_t r5 = 0U;
    return (SDIO_SUCCESS == R_SDIO_BrcmBackplaneWrite(&g_sdio_ctrl, address, true, &value, 1U, &r5));
}

static bool brcm_bp_read8(uint32_t address, uint8_t * p_value)
{
    uint32_t r5 = 0U;
    return (SDIO_SUCCESS == R_SDIO_BrcmBackplaneRead(&g_sdio_ctrl, address, true, p_value, 1U, &r5));
}

static bool brcm_bp_write32(uint32_t address, uint32_t value)
{
    uint32_t r5 = 0U;
    uint8_t data[4];

    data[0] = (uint8_t)value;
    data[1] = (uint8_t)(value >> 8);
    data[2] = (uint8_t)(value >> 16);
    data[3] = (uint8_t)(value >> 24);
    return (SDIO_SUCCESS == R_SDIO_BrcmBackplaneWrite(&g_sdio_ctrl, address, true, data, 4U, &r5));
}

/* Put a core into reset (IOCTRL=0, then RESETCTRL=AIRC_RESET). No-op if it is
 * already in reset. */
static bool brcm_core_disable(uint32_t wrap_base)
{
    uint8_t readback = 0U;

    if (!brcm_bp_read8(wrap_base + BRCM_AI_RESETCTRL_OFFSET, &readback))
    {
        return false;
    }
    if (0U != (readback & BRCM_AIRC_RESET))
    {
        return true;
    }

    if (!brcm_bp_write8(wrap_base + BRCM_AI_IOCTRL_OFFSET, 0U))
    {
        return false;
    }
    (void)brcm_bp_read8(wrap_base + BRCM_AI_IOCTRL_OFFSET, &readback);
    R_BSP_SoftwareDelay(1U, BSP_DELAY_MILLISECS);

    if (!brcm_bp_write8(wrap_base + BRCM_AI_RESETCTRL_OFFSET, BRCM_AIRC_RESET))
    {
        return false;
    }
    R_BSP_SoftwareDelay(1U, BSP_DELAY_MILLISECS);
    return true;
}

/* Reset a core and bring it back out of reset with clocks running. */
static bool brcm_core_reset(uint32_t wrap_base)
{
    uint8_t readback = 0U;

    if (!brcm_core_disable(wrap_base))
    {
        return false;
    }

    if (!brcm_bp_write8(wrap_base + BRCM_AI_IOCTRL_OFFSET, (uint8_t)(BRCM_SICF_FGC | BRCM_SICF_CLOCK_EN)))
    {
        return false;
    }
    (void)brcm_bp_read8(wrap_base + BRCM_AI_IOCTRL_OFFSET, &readback);

    if (!brcm_bp_write8(wrap_base + BRCM_AI_RESETCTRL_OFFSET, 0U))
    {
        return false;
    }
    R_BSP_SoftwareDelay(1U, BSP_DELAY_MILLISECS);

    if (!brcm_bp_write8(wrap_base + BRCM_AI_IOCTRL_OFFSET, BRCM_SICF_CLOCK_EN))
    {
        return false;
    }
    (void)brcm_bp_read8(wrap_base + BRCM_AI_IOCTRL_OFFSET, &readback);
    R_BSP_SoftwareDelay(1U, BSP_DELAY_MILLISECS);
    return true;
}

/*
 * Prepare SOCRAM for the firmware download: halt the WLAN ARM core, reset the
 * SOCRAM core, power up bank 3, then prove the SOCRAM data path with a 1-byte
 * and a 64-byte byte-mode write/read-back. Mirrors perf's socram_write_init.
 * Returns true once the round-trip matches.
 */
bool sdio_host_socram_init(void)
{
    uint8_t byte_value = 0U;
    uint8_t pattern[64];
    uint8_t verify[64];
    uint32_t i;
    uint32_t r5 = 0U;

    if (!brcm_core_disable(BRCM_ARM_WRAP_BASE))
    {
        return false;
    }
    if (!brcm_core_reset(BRCM_SOCRAM_WRAP_BASE))
    {
        return false;
    }
    if (!brcm_bp_write32(BRCM_SOCSRAM_BANKX_INDEX, 0x3UL) ||
        !brcm_bp_write32(BRCM_SOCSRAM_BANKX_PDA, 0UL))
    {
        return false;
    }

    if (!brcm_bp_write8(BRCM_RAM_BASE, 0xA5U) ||
        !brcm_bp_read8(BRCM_RAM_BASE, &byte_value) || (0xA5U != byte_value))
    {
        return false;
    }

    for (i = 0U; i < 64U; i++)
    {
        pattern[i] = (uint8_t)(i ^ (i >> 8));
    }
    if (SDIO_SUCCESS != R_SDIO_BrcmBackplaneWrite(&g_sdio_ctrl, BRCM_RAM_BASE, true, pattern, 64U, &r5))
    {
        return false;
    }
    if (SDIO_SUCCESS != R_SDIO_BrcmBackplaneRead(&g_sdio_ctrl, BRCM_RAM_BASE, true, verify, 64U, &r5))
    {
        return false;
    }
    for (i = 0U; i < 64U; i++)
    {
        if (pattern[i] != verify[i])
        {
            return false;
        }
    }

    return true;
}

/* Read-back scratch for the firmware verify (max chunk = 1024 bytes). */
static uint8_t g_fw_verify[1024];

/*
 * Stream a flash-resident image into card backplane RAM. Chunks are capped at
 * 1024 bytes, floored to 64-byte block-mode units, and never cross a 32 KB
 * backplane window; a sub-64-byte tail goes out in byte mode.
 */
static bool sdio_fw_write_region(uint32_t bp_addr, const uint8_t * p_src, uint32_t length)
{
    uint32_t offset = 0U;
    uint32_t r5 = 0U;

    while (offset < length)
    {
        uint32_t addr = bp_addr + offset;
        uint32_t window_left = 0x8000UL - (addr & 0x7FFFUL);
        uint32_t chunk = length - offset;
        uint32_t f1_address;

        if (chunk > 1024UL)
        {
            chunk = 1024UL;
        }
        if (chunk > window_left)
        {
            chunk = window_left;
        }
        if (chunk >= SDIO_FW_BLOCK_SIZE)
        {
            chunk &= ~(SDIO_FW_BLOCK_SIZE - 1UL);
        }

        if (SDIO_SUCCESS != R_SDIO_BrcmSetBackplaneWindow(&g_sdio_ctrl, addr, NULL, &r5))
        {
            return false;
        }
        f1_address = R_SDIO_BrcmBackplaneFunctionAddress(addr, chunk);

        if (chunk >= SDIO_FW_BLOCK_SIZE)
        {
            if (SDIO_SUCCESS != R_SDIO_Cmd53WriteBlocks(&g_sdio_ctrl, 1U, f1_address, true,
                                                        (uint8_t *)p_src + offset,
                                                        chunk / SDIO_FW_BLOCK_SIZE, &r5))
            {
                return false;
            }
        }
        else
        {
            if (SDIO_SUCCESS != R_SDIO_Cmd53WriteBytes(&g_sdio_ctrl, 1U, f1_address, true,
                                                       (uint8_t *)p_src + offset, chunk, &r5))
            {
                return false;
            }
        }
        offset += chunk;
    }

