HirokiIshiguro/iot-reference-rx/Projects/aws_wifi_rx671_ek/e2studio_ccrx/src/sdio_host.c
#if (SDIO_HOST_CMD53_XFER_ENGINE == SDIO_HOST_CMD53_XFER_DTC)
    if (NULL != p_done)
    {
        *p_done = g_cmd53_dtc_count;
    }
    if (NULL != p_ok)
    {
        *p_ok = g_cmd53_dtc_ok_count;
    }
    if (NULL != p_fail)
    {
        *p_fail = g_cmd53_dtc_fail_count;
    }
    if (NULL != p_fallback)
    {
        *p_fallback = g_cmd53_dtc_fallback_count;
    }
    if (NULL != p_error)
    {
        *p_error = g_cmd53_dtc_error;
    }
#elif (SDIO_HOST_CMD53_XFER_ENGINE == SDIO_HOST_CMD53_XFER_DMACA)
    if (NULL != p_done)
    {
        *p_done = g_cmd53_dmaca_count;
    }
    if (NULL != p_ok)
    {
        *p_ok = g_cmd53_dmaca_ok_count;
    }
    if (NULL != p_fail)
    {
        *p_fail = g_cmd53_dmaca_fail_count;
    }
    if (NULL != p_fallback)
    {
        *p_fallback = g_cmd53_dmaca_fallback_count;
    }
    if (NULL != p_error)
    {
        *p_error = g_cmd53_dmaca_error;
    }
#else
    if (NULL != p_done)
    {
        *p_done = 0U;
    }
    if (NULL != p_ok)
    {
        *p_ok = 0U;
    }
    if (NULL != p_fail)
    {
        *p_fail = 0U;
    }
    if (NULL != p_fallback)
    {
        *p_fallback = 0U;
    }
    if (NULL != p_error)
    {
        *p_error = 0U;
    }
#endif
}

void sdio_host_cmd53_xfer_fallback_diag(uint32_t * p_function, uint32_t * p_disabled,
                                        uint32_t * p_small, uint32_t * p_ineligible,
                                        uint32_t * p_prepare)
{
#if (SDIO_HOST_CMD53_XFER_ENGINE == SDIO_HOST_CMD53_XFER_DTC)
    if (NULL != p_function)
    {
        *p_function = g_cmd53_dtc_fb_function_count;
    }
    if (NULL != p_disabled)
    {
        *p_disabled = g_cmd53_dtc_fb_disabled_count;
    }
    if (NULL != p_small)
    {
        *p_small = g_cmd53_dtc_fb_small_count;
    }
    if (NULL != p_ineligible)
    {
        *p_ineligible = g_cmd53_dtc_fb_ineligible_count;
    }
    if (NULL != p_prepare)
    {
        *p_prepare = g_cmd53_dtc_fb_prepare_count;
    }
#elif (SDIO_HOST_CMD53_XFER_ENGINE == SDIO_HOST_CMD53_XFER_DMACA)
    if (NULL != p_function)
    {
        *p_function = g_cmd53_dmaca_fb_function_count;
    }
    if (NULL != p_disabled)
    {
        *p_disabled = g_cmd53_dmaca_fb_disabled_count;
    }
    if (NULL != p_small)
    {
        *p_small = g_cmd53_dmaca_fb_small_count;
    }
    if (NULL != p_ineligible)
    {
        *p_ineligible = g_cmd53_dmaca_fb_ineligible_count;
    }
    if (NULL != p_prepare)
    {
        *p_prepare = g_cmd53_dmaca_fb_prepare_count;
    }
#else
    if (NULL != p_function)
    {
        *p_function = 0U;
    }
    if (NULL != p_disabled)
    {
        *p_disabled = 0U;
    }
    if (NULL != p_small)
    {
        *p_small = 0U;
    }
    if (NULL != p_ineligible)
    {
        *p_ineligible = 0U;
    }
    if (NULL != p_prepare)
    {
        *p_prepare = 0U;
    }
#endif
}
